DataProcessors/ПланированиеМероприятий2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ПланированиеМероприятий2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Comment>Уникальный код контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзывПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_ПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Действующее</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Реестр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеОБанкротстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретЗвонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Comment>Трейд Софт</Comment>
			<Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
				<v8:Type>cfg:DocumentRef.РеструктуризацияМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
				<v8:Type>cfg:CatalogRef.Судьи</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
				<v8:Type>cfg:CatalogRef.СудебныеУчастки</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.тсЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Банки</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
				<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентовУЭД</v8:Type>
				<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
				<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
				<v8:Type>cfg:DocumentRef.ДоговорМикрозайма</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
				<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>32</v8:Digits>
					<v8:FractionDigits>6</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТипаСтрока</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочникВладелец</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемоеЗначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователейДоступность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокДоступныхЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

DataProcessors/ПланированиеМероприятий2/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Если Пользователь.Пустая() Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	РезультатЗаполнить = Планировщик.ПолучитьСписокМероприятий(Пользователь);
	ЗаполнитьЗапрос = ПоместитьВоВременноеХранилище(РезультатЗаполнить, Этаформа.УникальныйИдентификатор);	
	// Заполняем "ТипыМероприятий"	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ.ТипМероприятия
	                      |ПОМЕСТИТЬ ВТ1
	                      |ИЗ
	                      |	&ВТ1 КАК ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ1.ТипМероприятия КАК ТипМероприятия
	                      |ИЗ
	                      |	ВТ1 КАК ВТ1
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ1.ТипМероприятия");
    Запрос.УстановитьПараметр("ВТ1", РезультатЗаполнить);
	Результат = Запрос.Выполнить().Выбрать();	
	Если Результат.Количество() = 0 Тогда
		ВыдаватьСообщение = Истина;
		Возврат;
	КонецЕсли;	
	Пока Результат.Следующий() Цикл
	    Эл = ТипМероприятия.Добавить();
		Эл.ТипМероприятия = Результат.ТипМероприятия;
	КонецЦикла;	
	ТипМероприятия.Сортировать("ТипМероприятия");
	Если ВыбранныйТипМероприятия.Пустая() Тогда 
		Если ТипМероприятия.Количество() > 0 Тогда
			Элементы.ТипыМероприятия.ТекущаяСтрока = ТипМероприятия[0].ПолучитьИдентификатор(); 	
		КонецЕсли;
	Иначе                   
		НайденныеСтроки = ТипМероприятия.НайтиСтроки(Новый Структура("ТипМероприятия", ВыбранныйТипМероприятия));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы.ТипыМероприятия.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ТипыМероприятияПриАктивизацииСтроки(Элемент)
	Попытка 	
		ВыбранныйТипМероприятия = Элемент.ТекущиеДанные.ТипМероприятия;	
	Исключение
		Возврат;
	КонецПопытки;	
	ЗаполнитьТипМероприятия(ВыбранныйТипМероприятия);		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипМероприятия(ВыбранныйТипМероприятия)
	ТЗ = ПолучитьИзВременногоХранилища(ЗаполнитьЗапрос);			
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	ВТ.Должник
	                       |ПОМЕСТИТЬ ВТ1
	                       |ИЗ
	                       |	&ВТ1 КАК ВТ
	                       |ГДЕ
	                       |	ВТ.ТипМероприятия = &ТипМероприятия
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ1.Должник КАК Контрагент,
	                       |	ВТ1.Должник КАК КонтрагентСсылка,
	                       |	ЕСТЬNULL(КонтрагентыДополнительныеРеквизиты.Значение, """") КАК Адрес
	                       |ИЗ
	                       |	ВТ1 КАК ВТ1
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	                       |		ПО ВТ1.Должник = КонтрагентыДополнительныеРеквизиты.Ссылка
	                       |			И (КонтрагентыДополнительныеРеквизиты.Свойство = &Свойство)
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ВТ1.Должник,
	                       |	КонтрагентыДополнительныеРеквизиты.Значение,
	                       |	ВТ1.Должник");
	Запрос.УстановитьПараметр("ВТ1", ТЗ);
	Запрос.УстановитьПараметр("ТипМероприятия", ВыбранныйТипМероприятия);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("0000     "));
	СтрокиТипМероприятия = Запрос.Выполнить();	
	Если СтрокиТипМероприятия.Пустой() Тогда
		Объект.Контрагент.Очистить();
		Возврат;
	Иначе
		Объект.Контрагент.Загрузить(СтрокиТипМероприятия.Выгрузить());
		Объект.Контрагент.Сортировать("Контрагент");
		Если ВыбранныйКонтрагент.Пустая() Тогда 
			Элементы.Контрагенты.ТекущаяСтрока = Объект.Контрагент[0].ПолучитьИдентификатор(); 	
		Иначе                   
			Если Объект.Контрагент.НайтиСтроки(Новый Структура("Контрагент", ВыбранныйКонтрагент)).Количество() = 0 Тогда
				Элементы.Контрагенты.ТекущаяСтрока = Объект.Контрагент[0].ПолучитьИдентификатор(); 	
			Иначе	
				Элементы.Контрагенты.ТекущаяСтрока = 
						Объект.Контрагент.НайтиСтроки(Новый Структура("Контрагент", ВыбранныйКонтрагент))[0].ПолучитьИдентификатор();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;			
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	Попытка 
		ВыбранныйКонтрагент = Элемент.ТекущиеДанные.КонтрагентСсылка;	
	Исключение	
		Возврат;	
	КонецПопытки;	
	КонтрагентыПриАктивизацииСтрокиНаСервере(ВыбранныйКонтрагент);		
КонецПроцедуры

&НаСервере
Процедура КонтрагентыПриАктивизацииСтрокиНаСервере(ВыбранныйКонтрагент)
	Мероприятия.Очистить();	
	ТЗ = ПолучитьИзВременногоХранилища(ЗаполнитьЗапрос);
	СтрокиМероприятия = ТЗ.НайтиСтроки(Новый Структура("ТипМероприятия, Должник", ВыбранныйТипМероприятия, ВыбранныйКонтрагент));
	Если СтрокиМероприятия.Количество() > 0 Тогда
		Для Каждого Эл Из СтрокиМероприятия Цикл
			Стр = Мероприятия.Добавить();
			Стр.Мероприятия = Эл.Мероприятие;
		КонецЦикла;	
		Мероприятия.Сортировать("Мероприятия");
		Элементы.Мероприятия1.ТекущаяСтрока = Мероприятия[0].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Мероприятия1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ОткрытьЗначение(Элемент.ТекущиеДанные.Мероприятия);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ОчиститьСообщения();
	ТипМероприятия.Очистить();
	Объект.Контрагент.Очистить();
	Мероприятия.Очистить();
	ПриСозданииНаСервере(Ложь, Ложь);
    ВыдаватьСообщение();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьПланировщик" И Параметр = Истина Тогда 
		Попытка 
			УдалитьМероприятие(Источник);
		Исключение
		КонецПопытки;
	ИначеЕсли  ИмяСобытия = "ОбновитьПланировщик" И Параметр = Ложь Тогда
		// Для механизма когда по ошибке выполнили мероприятие, а затем
		// нажали отмену выполнения.
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьМероприятие(Ссылка);
	Мероприятия.Удалить(Мероприятия.НайтиПоИдентификатору(Элементы.Мероприятия1.ТекущаяСтрока));
	ТЗ = ПолучитьИзВременногоХранилища(ЗаполнитьЗапрос);	
	СтрТЧ = ТЗ.Найти(Ссылка, "Мероприятие");	
	ТЗ.Удалить(СтрТЧ);
	Если Мероприятия.Количество() = 0 Тогда		
		Объект.Контрагент.Удалить(Объект.Контрагент.НайтиПоИдентификатору(Элементы.Контрагенты.ТекущаяСтрока));	
	КонецЕсли;
	Если Объект.Контрагент.Количество() = 0 Тогда
		ТипМероприятия.Удалить(ТипМероприятия.НайтиПоИдентификатору(Элементы.ТипыМероприятия.ТекущаяСтрока));		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОчиститьСообщения();
	Если Элементы.ТипыМероприятия.ТекущаяСтрока = Неопределено Тогда
		ВыдаватьСообщение = Истина;
		ВыдаватьСообщение();
		Возврат;	
	КонецЕсли;
	ВыбранныйТипМероприятия = Элементы.ТипыМероприятия.ТекущиеДанные.ТипМероприятия;
	ВыбранныйКонтрагент     = Элементы.Контрагенты.ТекущиеДанные.Контрагент;
	ТипМероприятия.Очистить();
	Объект.Контрагент.Очистить();
	Мероприятия.Очистить();
	ПриСозданииНаСервере(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыдаватьСообщение();	
КонецПроцедуры

&НаКлиенте
Процедура ВыдаватьСообщение()
	Если ВыдаватьСообщение Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет не выполненных мероприятий.";
		Сообщение.ИдентификаторНазначения = Этаформа.УникальныйИдентификатор;
		Сообщение.Сообщить();
	КонецЕсли;
	ВыдаватьСообщение = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элемент.ТекущиеДанные.КонтрагентСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПометкаУдаления(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Пометить на удаление все мероприятия с данным типом !!!", Режим, 40, 
			КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ПометкаУдаленияСервер();
КонецПроцедуры

Процедура ПометкаУдаленияСервер()
	ТЗ_ПометкаУдаления = ПолучитьИзВременногоХранилища(ЗаполнитьЗапрос);			
	Запрос = Новый Запрос( "ВЫБРАТЬ
	                       |	ВТ.ТипМероприятия,
	                       |	ВТ.Должник,
	                       |	ВТ.Мероприятие
	                       |ПОМЕСТИТЬ ВТ1
	                       |ИЗ
	                       |	&ВТ1 КАК ВТ
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ1.Должник КАК Должник,
	                       |	ВТ1.Мероприятие
	                       |ИЗ
	                       |	ВТ1 КАК ВТ1
	                       |ГДЕ
	                       |	ВТ1.ТипМероприятия = &ТипМероприятия");
	Запрос.УстановитьПараметр("ВТ1", ТЗ_ПометкаУдаления);
	Запрос.УстановитьПараметр("ТипМероприятия", ВыбранныйТипМероприятия);	
	Результат_ПометкаУдаления = Запрос.Выполнить().Выбрать();
	УдалятьТипМероприятия = Истина;
	Пока Результат_ПометкаУдаления.Следующий() Цикл
		Попытка
			Результат_ПометкаУдаления.Мероприятие.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			СтрТЧ = ТЗ_ПометкаУдаления.Найти(Результат_ПометкаУдаления.Мероприятие, "Мероприятие");	
			ТЗ_ПометкаУдаления.Удалить(СтрТЧ);
		Исключение
			Сообщить("Невозможно удалить " + Результат_ПометкаУдаления.Мероприятие);
			УдалятьТипМероприятия = Ложь;
		Конецпопытки
	КонецЦикла;
	Если УдалятьТипМероприятия Тогда
		ТипМероприятия.Удалить(ТипМероприятия.НайтиПоИдентификатору(Элементы.ТипыМероприятия.ТекущаяСтрока));
	Иначе
		Попытка 
			ЗаполнитьТипМероприятия(ВыбранныйТипМероприятия);		
		Исключение	
			Возврат;	
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
